In [ ]:
# install numpy

In [1]:
pip install numpy

Requirement already satisfied: numpy in c:\users\admin\anaconda3\lib\site-packages (1.21.5)Note: you may need to restart the kernel to use updated packages.

In [39]:
import numpy as np

In [3]:
a = np.array([1,2,3,4,5])

In [4]:
a

array([1, 2, 3, 4, 5])

In [40]:
a1 = np.array([1.1,2.3,3.3])

In [41]:
a1

array([1.1, 2.3, 3.3])

In [42]:
a1.dtype

dtype('float64')

In [48]:
z=np.zeros(5)

In [49]:
z

array([0., 0., 0., 0., 0.])

In [45]:
z.dtype

dtype('float64')

In [50]:
z1=np.zeros(5,dtype ="int")
z1

array([0, 0, 0, 0, 0])

In [51]:
z1.dtype

dtype('int32')

In [52]:
z2= np.ones(9,dtype='int')
z2

array([1, 1, 1, 1, 1, 1, 1, 1, 1])

In [53]:
z2.dtype

dtype('int32')

In [54]:
np.full(10,8.88)

array([8.88, 8.88, 8.88, 8.88, 8.88, 8.88, 8.88, 8.88, 8.88, 8.88])

In [55]:
#create an array with a range of values

In [56]:
#np.array(start,stop,step)

In [57]:
np.arange(8,18)

array([ 8,  9, 10, 11, 12, 13, 14, 15, 16, 17])

In [58]:
np.arange(8,18,2)

array([ 8, 10, 12, 14, 16])

In [59]:
#Create evenly spaced values
np.linspace(1,10,5)

array([ 1.  ,  3.25,  5.5 ,  7.75, 10.  ])

In [60]:
# used in liner plotting in ML

In [61]:
np.linspace(1,10,10)

array([ 1.,  2.,  3.,  4.,  5.,  6.,  7.,  8.,  9., 10.])

In [62]:
#ndarray = N-dimentional array

In [63]:
s1=np.array([1, 1, 1, 1, 1, 1, 1, 1, 1])
s1

array([1, 1, 1, 1, 1, 1, 1, 1, 1])

In [65]:
s1.shape

(9,)

In [66]:
s1.ndim

1

In [67]:
s1.size

9

In [69]:
s2= np.array([[1,2,3],[4,5,6]])

In [70]:
s2

array([[1, 2, 3],
       [4, 5, 6]])

In [71]:
s2.ndim

2

In [72]:
s2.size

6

In [73]:
s2.shape

(2, 3)

In [75]:
s3= np.array([[[1,2,3],[4,5,6]],[[9,8,7],[5,6,7]]])
s3

array([[[1, 2, 3],
        [4, 5, 6]],

       [[9, 8, 7],
        [5, 6, 7]]])

In [76]:
s3.size

12

In [77]:
s3.shape

(2, 2, 3)

In [78]:
s3.ndim

3

In [79]:
#converts multi-dimentional array into 1D
s3.flatten()

array([1, 2, 3, 4, 5, 6, 9, 8, 7, 5, 6, 7])

In [81]:
b=np.array([[1,2,3],[4,5,6],[7,8,9]])
b

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [82]:
b*2

array([[ 2,  4,  6],
       [ 8, 10, 12],
       [14, 16, 18]])

In [84]:
b1=np.array([1,2,3,4,5,6,7,8,9,10])
b1

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [85]:
b1*2

array([ 2,  4,  6,  8, 10, 12, 14, 16, 18, 20])

In [86]:
b1 + 5

array([ 6,  7,  8,  9, 10, 11, 12, 13, 14, 15])

In [ ]:
#you have the sorted Numpy array of numbers
#given a target value , find the cosest number in the array

In [87]:
n1=np.array([3,5,6,7,8,3,210,74,23,856,77,55,888])

In [88]:
n1

array([  3,   5,   6,   7,   8,   3, 210,  74,  23, 856,  77,  55, 888])

In [98]:
n1.sort()
n1

array([  3,   3,   5,   6,   7,   8,  23,  55,  74,  77, 210, 856, 888])

In [113]:
t=211

In [114]:
index= np.abs(n1-t).argmin()

In [115]:
n1[index]

210

In [109]:
#n=nparray(input().split(),dtype=int)

In [ ]:
#a=np.sort(n)

In [116]:
pip install pandas

Requirement already satisfied: pandas in c:\users\admin\anaconda3\lib\site-packages (1.4.4)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: pytz>=2020.1 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: numpy>=1.18.5 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\admin\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\admin\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [117]:
#pandas = data analysis and manipulation

In [118]:
import pandas as pd

In [119]:
#data structure - series(Like a single column in a table (1D))
#dataframe- like a full table with rows and columns (2D)

In [121]:
d =pd.Series([1,2,3,4,5,6,7,8])
d

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [122]:
type(d)

pandas.core.series.Series

In [123]:
#custom index

In [129]:
d1 =pd.Series([1,2,3,4,5,6,7,8], index =['a','b','c','d','e','f','g','h'])
d1

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
dtype: int64

In [131]:
d1['b']

2

In [132]:
d.iloc[3]

4

In [135]:
d1.loc['a']

1

In [137]:
d1.loc[['a','b','h']]

a    1
b    2
h    8
dtype: int64

In [138]:
d1[['a','b','h']]

a    1
b    2
h    8
dtype: int64

In [139]:
d1.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'], dtype='object')

In [140]:
d

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [145]:
d[0]=100

In [146]:
d

0    100
1      2
2      3
3      4
4      5
5      6
6      7
7      8
a    100
0    100
dtype: int64

In [148]:
d1['i'] =333

In [149]:
d1

a      1
b      2
c      3
d      4
e      5
f      6
g      7
h      8
i    333
dtype: int64

In [150]:
d[d>20]

0    100
a    100
0    100
dtype: int64

In [151]:
d

0    100
1      2
2      3
3      4
4      5
5      6
6      7
7      8
a    100
0    100
dtype: int64

In [152]:
d1['g']=888

In [153]:
d1

a      1
b      2
c      3
d      4
e      5
f      6
g    888
h      8
i    333
dtype: int64

In [155]:
d1[d1>20]

g    888
i    333
dtype: int64

In [156]:
d1>20

a    False
b    False
c    False
d    False
e    False
f    False
g     True
h    False
i     True
dtype: bool

In [157]:
#delete
d1.drop('b')

a      1
c      3
d      4
e      5
f      6
g    888
h      8
i    333
dtype: int64

In [163]:
f1=d.drop(0)
f1

1      2
2      3
3      4
4      5
5      6
6      7
7      8
a    100
0    100
dtype: int64

In [160]:
d*7

0    700
1     14
2     21
3     28
4     35
5     42
6     49
7     56
a    700
0    700
dtype: int64

In [161]:
d+9

0    109
1     11
2     12
3     13
4     14
5     15
6     16
7     17
a    109
0    109
dtype: int64

In [165]:
#to apply lambda function
f1.apply(lambda x:x*5)

1     10
2     15
3     20
4     25
5     30
6     35
7     40
a    500
0    500
dtype: int64

In [166]:
d

0    100
1      2
2      3
3      4
4      5
5      6
6      7
7      8
a    100
0    100
dtype: int64

In [167]:

np.zeros((2, 3))

array([[0., 0., 0.],
       [0., 0., 0.]])

In [168]:
NUM1=np.array([[1,2,3],[4,5,6],[7,8,9]])
NUM1

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [169]:
np.transpose(NUM1)

array([[1, 4, 7],
       [2, 5, 8],
       [3, 6, 9]])

In [170]:
NUM1.T

array([[1, 4, 7],
       [2, 5, 8],
       [3, 6, 9]])

In [171]:

NUM1.transpose()

array([[1, 4, 7],
       [2, 5, 8],
       [3, 6, 9]])

In [179]:
import numpy as np
arr1 =np.array([[1,2,3],[4,5,6]])
arr2 =np.array([[1],[2]])
res= np.dot(arr2,arr1)

ValueError: shapes (2,1) and (2,3) not aligned: 1 (dim 1) != 2 (dim 0)

In [177]:
np.random.rand(3, 2)

array([[0.35097957, 0.38026126],
       [0.11082791, 0.69263488],
       [0.01668571, 0.88273769]])

In [181]:
import numpy as np

In [186]:

arr1 =np.array([[1,2],[4,5],[6,7]])
res=np.apply_along_axis(np.sum,axis=1,arr1=arr1)
"""NUM1=np.array([[1,2,3],[4,5,6],[7,8,9]])
res=np.apply_along_axis(np.sum,axis=1,NUM1=NUM1)"""

TypeError: _apply_along_axis_dispatcher() missing 1 required positional argument: 'arr'

In [1]:
import pandas as pd
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)
print(df.loc[1])

A    2
B    5
Name: 1, dtype: int64

In [ ]:
#pamdas Dataframe

In [4]:
data1 = {'Name': ['sneha','poo','shiva'], 'Age': [4, 5, 6],
       'Salary':[11111,22435,567777]}

In [6]:
d1 =pd.DataFrame(data1)
d1

    Name  Age  Salary
0  sneha    4   11111
1    poo    5   22435
2  shiva    6  567777

In [7]:
#using list of list

data2 =[['sneha','poo','shiva'], [4, 5, 6], [11111,22435,567777]]

In [9]:
d2 =pd.DataFrame(data2,columns= ['Name','Age','Salary'])
d2

    Name    Age  Salary
0  sneha    poo   shiva
1      4      5       6
2  11111  22435  567777

In [10]:
#loading the data

In [38]:
df = pd.read_csv('Coffee_Chain_Sales .csv')
df

,Area Code,Cogs,DifferenceBetweenActualandTargetProfit,Date,Inventory Margin,Margin,Market_size,Market,Marketing,Product_line,...,Product,Profit,Sales,State,Target_cogs,Target_margin,Target_profit,Target_sales,Total_expenses,Type
0,303,51,-35,10/1/2012,503,71,Major Market,Central,46,Leaves,...,Lemon,-5,122,Colorado,30,60,30,90,76,Decaf
1,970,52,-24,10/1/2012,405,71,Major Market,Central,17,Leaves,...,Mint,26,123,Colorado,30,60,50,90,45,Decaf
2,409,43,-22,10/2/2012,419,64,Major Market,South,13,Leaves,...,Lemon,28,107,Texas,30,60,50,90,36,Decaf
3,850,38,-15,10/3/2012,871,56,Major Market,East,10,Leaves,...,Darjeeling,35,94,Florida,40,60,50,100,21,Regular
4,562,72,6,10/4/2012,650,110,Major Market,West,23,Leaves,...,Green Tea,56,182,California,20,60,50,80,54,Regular
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1057,775,250,133,8/23/2015,1820,251,Small Market,West,70,Leaves,...,Earl Grey,233,534,Nevada,180,180,100,360,94,Regular
1058,971,88,48,8/24/2015,817,133,Small Market,West,29,Leaves,...,Earl Grey,108,236,Oregon,60,100,60,160,60,Regular
1059,775,294,-285,8/25/2015,8252,-294,Small Market,West,111,Leaves,...,Green Tea,-605,33,Nevada,210,-210,-320,0,145,Regular
1060,503,134,80,8/26/2015,690,186,Small Market,West,41,Leaves,...,Green Tea,180,341,Oregon,90,140,100,230,65,Regular
1061,435,20,-22,8/27/2015,218,25,Small Market,West,7,Leaves,...,Green Tea,-22,48,Utah,10,20,0,30,40,Regular

In [14]:
#accessing the DATA
d1['Name']

0    sneha
1      poo
2    shiva
Name: Name, dtype: object

In [16]:
df['Area Code']

0       303
1       970
2       409
3       850
4       562
       ...
1057    775
1058    971
1059    775
1060    503
1061    435
Name: Area Code, Length: 1062, dtype: int64

In [17]:
d1.loc[0]

Name      sneha
Age           4
Salary    11111
Name: 0, dtype: object

In [18]:
d1.iloc[0]

Name      sneha
Age           4
Salary    11111
Name: 0, dtype: object

In [22]:
d1

    Name  Age  Salary
0  sneha    4   11111
1    poo    5   22435
2  shiva    6  567777

In [23]:
#salary of poo
d1.loc[1,'Salary']
#dataframe_name[row_index,col_label]

22435

In [24]:
#modification

In [25]:
#update the value- bob's salary
d1.at[1,'Salary']=78666
d1

    Name  Age  Salary
0  sneha    4   11111
1    poo    5   78666
2  shiva    6  567777

In [26]:
#addthe new coloum
d1['Bonus']=d1['Salary']*0.22
d1

    Name  Age  Salary      Bonus
0  sneha    4   11111    2444.42
1    poo    5   78666   17306.52
2  shiva    6  567777  124910.94

In [31]:
#add new row
n=pd.DataFrame([['SP',33,897000,12000]],columns=d1.columns)
n

  Name  Age  Salary  Bonus
0   SP   33  897000  12000

In [32]:
#concat is used to merge data frames
d1=pd.concat([d1,n],ignore_index=True)
d1

    Name  Age  Salary      Bonus
0  sneha    4   11111    2444.42
1    poo    5   78666   17306.52
2  shiva    6  567777  124910.94
3     SP   33  897000    4000.00
4     SP   33  897000   12000.00

In [33]:
d1.at[3,'Salary']=800000

In [34]:
d1

    Name  Age  Salary      Bonus
0  sneha    4   11111    2444.42
1    poo    5   78666   17306.52
2  shiva    6  567777  124910.94
3     SP   33  800000    4000.00
4     SP   33  897000   12000.00

In [35]:
#deletion - inplace= True(Makes sure the deletion is permanent)
#axis =0 row
d1.drop(2,axis=0,inplace=True)
d1

    Name  Age  Salary     Bonus
0  sneha    4   11111   2444.42
1    poo    5   78666  17306.52
3     SP   33  800000   4000.00
4     SP   33  897000  12000.00

In [36]:
d1.drop('Bonus',axis=1,inplace=True)

In [37]:
d1

    Name  Age  Salary
0  sneha    4   11111
1    poo    5   78666
3     SP   33  800000
4     SP   33  897000

In [ ]:
d1.index_reset

In [40]:
df

,Area Code,Cogs,DifferenceBetweenActualandTargetProfit,Date,Inventory Margin,Margin,Market_size,Market,Marketing,Product_line,...,Product,Profit,Sales,State,Target_cogs,Target_margin,Target_profit,Target_sales,Total_expenses,Type
0,303,51,-35,10/1/2012,503,71,Major Market,Central,46,Leaves,...,Lemon,-5,122,Colorado,30,60,30,90,76,Decaf
1,970,52,-24,10/1/2012,405,71,Major Market,Central,17,Leaves,...,Mint,26,123,Colorado,30,60,50,90,45,Decaf
2,409,43,-22,10/2/2012,419,64,Major Market,South,13,Leaves,...,Lemon,28,107,Texas,30,60,50,90,36,Decaf
3,850,38,-15,10/3/2012,871,56,Major Market,East,10,Leaves,...,Darjeeling,35,94,Florida,40,60,50,100,21,Regular
4,562,72,6,10/4/2012,650,110,Major Market,West,23,Leaves,...,Green Tea,56,182,California,20,60,50,80,54,Regular
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1057,775,250,133,8/23/2015,1820,251,Small Market,West,70,Leaves,...,Earl Grey,233,534,Nevada,180,180,100,360,94,Regular
1058,971,88,48,8/24/2015,817,133,Small Market,West,29,Leaves,...,Earl Grey,108,236,Oregon,60,100,60,160,60,Regular
1059,775,294,-285,8/25/2015,8252,-294,Small Market,West,111,Leaves,...,Green Tea,-605,33,Nevada,210,-210,-320,0,145,Regular
1060,503,134,80,8/26/2015,690,186,Small Market,West,41,Leaves,...,Green Tea,180,341,Oregon,90,140,100,230,65,Regular
1061,435,20,-22,8/27/2015,218,25,Small Market,West,7,Leaves,...,Green Tea,-22,48,Utah,10,20,0,30,40,Regular

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1062 entries, 0 to 1061
Data columns (total 21 columns):
 #   Column                                  Non-Null Count  Dtype
---  ------                                  --------------  -----
 0   Area Code                               1062 non-null   int64
 1   Cogs                                    1062 non-null   int64
 2   DifferenceBetweenActualandTargetProfit  1062 non-null   int64
 3   Date                                    1062 non-null   object
 4   Inventory Margin                        1062 non-null   int64
 5   Margin                                  1062 non-null   int64
 6   Market_size                             1062 non-null   object
 7   Market                                  1062 non-null   object
 8   Marketing                               1062 non-null   int64
 9   Product_line                            1062 non-null   object
 10  Product_type                            1062 non-null   object
 11  Product                                 1062 non-null   object
 12  Profit                                  1062 non-null   int64
 13  Sales                                   1062 non-null   int64
 14  State                                   1062 non-null   object
 15  Target_cogs                             1062 non-null   int64
 16  Target_margin                           1062 non-null   int64
 17  Target_profit                           1062 non-null   int64
 18  Target_sales                            1062 non-null   int64
 19  Total_expenses                          1062 non-null   int64
 20  Type                                    1062 non-null   object
dtypes: int64(13), object(8)
memory usage: 174.4+ KB